# How to Make The Best Movies Part 3

In [1]:
#import necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

## Normalize Genre:

* convert the single string of genres from title basics into 2 new tables
    * title genres: with the columns: 
        * tconst
        * genre_id
    * genres: 
        * genre_id
        * genre_name

### title_basics

In [2]:
#load file and disply rows
df_title_basics = pd.read_csv('Data/title_basics.csv.gz')
df_title_ratings = pd.read_csv('Data/title_ratings.csv.gz')

display(df_title_basics.head(), df_title_ratings.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

In [3]:
#create a col with a list of genres
df_title_basics['genres_split'] = df_title_basics['genres'].str.split(',')
df_title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
80718,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
80719,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
80720,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
80721,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
80722,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
#separate list of genres into new rows
exploded_genres = df_title_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
80721,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
80721,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
80721,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
80722,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
80722,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
#display unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
#save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
#make a genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
#make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [9]:
#manually make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Saving SQL Database

### df_title_basics

In [10]:
##loading sql credentials
with open('/Users/chas/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [11]:
# Create connection string using credentials following this format
## Change username and password to match your personal MySQL Server settings
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/Movies"
engine = create_engine(connection_str)

In [12]:
# Create Movies database, if it does not already exist
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [13]:
#display datatypes
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80723 entries, 0 to 80722
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          80723 non-null  object
 1   titleType       80723 non-null  object
 2   primaryTitle    80723 non-null  object
 3   originalTitle   80723 non-null  object
 4   isAdult         80723 non-null  int64
 5   startYear       80723 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  80723 non-null  int64
 8   genres          80723 non-null  object
 9   genres_split    80723 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.2+ MB

In [14]:
#drop the unnecessary columns
df_title_basics = df_title_basics.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult', 'endYear', 'genres', 'genres_split'])
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80723 entries, 0 to 80722
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          80723 non-null  object
 1   primaryTitle    80723 non-null  object
 2   startYear       80723 non-null  int64
 3   runtimeMinutes  80723 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

In [15]:
#calculate max string lengths
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df_title_basics['tconst'].fillna('').map(len).max()
title_len = df_title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [16]:
#save the sql with dtype and index=False
df_title_basics.to_sql('title_basics', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [17]:
#update the table and column with sqlalchemy
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

### df_title_ratings

In [18]:
df_title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1237390 entries, 0 to 1237389
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1237390 non-null  object
 1   averageRating  1237390 non-null  float64
 2   numVotes       1237390 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.3+ MB

In [19]:
## Calculate max string lengths for object columns
key_len = df_title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes': Integer()}

In [20]:
#save to sql with dtype and index=False
df_title_ratings.to_sql('title_ratings', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [21]:
# Use the sqlalchemy engine to update the table and set tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

### title_genres

In [22]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150642 entries, 0 to 80722
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    150642 non-null  object
 1   genre_id  150642 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.4+ MB

In [23]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

In [24]:
#save to sql with dtype and index=false
title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

### genres

In [25]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [26]:
## Calculate max string lengths for object columns
key_len = genre_lookup['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id': Integer()}

In [27]:
#save to sql with dtype and index=false
genre_lookup.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

In [28]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

### tmdb

In [29]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
1,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
2,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1863.0,PG
4,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.9,45.0,R

In [30]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2472 non-null   object
 1   adult                  2472 non-null   float64
 2   backdrop_path          1241 non-null   object
 3   belongs_to_collection  192 non-null    object
 4   budget                 2472 non-null   float64
 5   genres                 2472 non-null   object
 6   homepage               171 non-null    object
 7   id                     2472 non-null   float64
 8   original_language      2472 non-null   object
 9   original_title         2472 non-null   object
 10  overview               2419 non-null   object
 11  popularity             2472 non-null   float64
 12  poster_path            2157 non-null   object
 13  production_companies   2472 non-null   object
 14  production_countries   2472 non-null   object
 15  release_date           2451 non-null   object
 16  revenue                2472 non-null   float64
 17  runtime                2426 non-null   float64
 18  spoken_languages       2472 non-null   object
 19  status                 2472 non-null   object
 20  tagline                1019 non-null   object
 21  title                  2472 non-null   object
 22  video                  2472 non-null   float64
 23  vote_average           2472 non-null   float64
 24  vote_count             2472 non-null   float64
 25  certification          785 non-null    object
dtypes: float64(9), object(17)
memory usage: 502.2+ KB

In [31]:
tmdb_df = tmdb_df.drop(columns = ['adult', 'backdrop_path','belongs_to_collection',
                               'genres', 'homepage', 'id', 'original_language', 
                              'original_title', 'overview', 'popularity', 
                              'poster_path', 'production_companies',
                               'production_countries', 'release_date', 
                              'runtime', 'spoken_languages', 'status', 
                              'tagline', 'title', 'video', 'vote_average', 
                              'vote_count'])
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2472 non-null   object
 1   budget         2472 non-null   float64
 2   revenue        2472 non-null   float64
 3   certification  785 non-null    object
dtypes: float64(2), object(2)
memory usage: 77.4+ KB

In [32]:
# Calculate max string lengths for object columns ('tconst' and 'primaryTitle')
imdb_id_len = tmdb_df['imdb_id'].fillna('').map(len).max()

certification_len = tmdb_df['certification'].fillna('').map(len).max()



# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(), 
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [33]:
tmdb_df.to_sql('tmdb_data', engine, dtype=df_schema, 
              if_exists='replace', index=False)

In [34]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

### SQL Table and Rows

In [35]:
# Run show tables query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [36]:
#genres
q = """
SELECT * 
FROM genres LIMIT 3
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

In [37]:
q = """
SELECT * 
FROM title_basics LIMIT 3
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122

In [38]:
q = """
SELECT * 
FROM title_genres LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18

In [39]:
q = """
SELECT * 
FROM title_ratings LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647

In [40]:
q = """
SELECT * 
FROM tmdb_data LIMIT 3
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None